#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3.aws_s3_bucket_acl.log has changed
  ~ resource "aws_s3_bucket_acl" "log" {
        id                    = "aih.dev.br-log,log-delivery-write"
        # (3 unchanged attributes hidden)

      ~ access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "379ab14eb2e1ef37f67395d7397e36572e6ebd5df015a9f51301eea34e7d636b" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          + grant {
              + permission = "FULL_CONTROL"

              + grantee {
                  + display_name  = "hiagop101197"
                  + id            = "379ab14eb2e1ef37f67395d7397e36572e6ebd5df015a9f51301eea34e7d636b"
                  + type          = "CanonicalUser"
                    # (2 unchanged attributes hidden)
                }
            }

            # (4 unchanged blocks hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3.aws_s3_object.upload_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_object" {
      ~ etag                          = "0ac88c0b97a708435f3ff3920ad35be2" -> "5354a05265db06233ba4434dff4a06f5"
        id                            = "index.html"
        tags                          = {}
      + version_id                    = (known after apply)
        # (22 unchanged attributes hidden)
    }

  # module.s3.aws_s3_object.upload_object["main-5CEAWMEF.js"] will be destroyed
  # (because key ["main-5CEAWMEF.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_object" {
      - bucket                        = "aih.dev.br" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "e79fb23ac34cc7661b443ce6f6c4ea01" -> null
      - force_destroy                 = false -> null
      - id                            = "main-5CEAWMEF.js" -> null
      - key                           = "main-5CEAWMEF.js" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../website/dist/personal-website/browser/main-5CEAWMEF.js" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "CreatedAt" = "2024-03-16"
          - "Project"   = "AWS com Terraform"
          - "Service"   = "Static Website"
        } -> null
        # (13 unchanged attributes hidden)
    }

  # module.s3.aws_s3_object.upload_object["main-N7B43LOF.js"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "ebbc6d2b02d9890efe89a77147fb0b12"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "main-N7B43LOF.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/main-N7B43LOF.js"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ fileset-results = [
        # (1 unchanged element hidden)
        "index.html",
      ~ "main-5CEAWMEF.js" -> "main-N7B43LOF.js",
        "polyfills-RT5I6R6G.js",
        # (1 unchanged element hidden)
    ]
```

</details>

*Pusher: @hiagop22, Action: `pull_request`, Workflow: `Terraform Plan`*